[
  {
    "id": 603,
    "category": "Reasoning & Synthesis",
    "question": "Was passiert, wenn der Ball beim Kickoff out of bounds landet?",
    "ground_truth": "Das ist ein Foul. Wenn ein Kickoff oder Onside Kick versucht wurde darf die Offense wählen ob: der Ball am Spot des Fouls, oder 25 Yards vor dem Kick-Punkt. Wenn ein Saftey Kick versucht wurde sind es 30 Yards.",
    "source_ref": "Rule 6, Section 2",
    "context_text": "SECTION 2 OTHER FREE KICK FOULS\nARTICLE 1. BLOCKING DURING A KICKOFF OR SAFETY KICK.\nItem 1. Kicking Team. After the ball hits or is touched in the landing zone or end zone, a kicking team player may legally block\nan opponent, and he may use his hands and arms to push or pull an opponent out of the way in a personal attempt to recover the\nball or push or pull aside a receiver who is actively attempting to obstruct his attempt to proceed downfield. During the kick, the\nkicking team is subject to the blocking restrictions of the defense.\nItem 2. Receiving Team.\n(a) Until the ball hits or is touched in the landing zone or end zone, no player of the receiving team may initiate a block against\nthe kicking team.\n(b) During the kick, receiving team players are subject to the blocking restrictions of the offense (see 12-1-1 through 12-1-3), and\nthey may use their hands/arms legally to push or pull an opponent out of the way in a personal attempt to recover the ball.\nPenalty: For illegal blocking or use of hands by either team: Loss of 10 yards.\n(c) A “double team block” is permissible only by players who were initially lined up in the setup zone at the time of the kick. A\ndouble team block is defined as two or more players who contact an opponent at the same time. Any other players may not\nparticipate in a double team block at any time during a kick or during a return.\n(d) A “wedge block” is not permitted by any players at any time. A wedge block is defined as two or more players intentionally\naligning shoulder-to-shoulder within two yards of each other, and who move forward together. The foul for a wedge block\noccurs at that point; actual contact with an opponent is not necessary.\nPenalty: For an illegal wedge block or an illegal double team block: Loss of 15 yards. If the foul occurs during the kick,\nenforcement is from the spot of the foul. If the foul occurs during the return, the penalty is enforced as customary. If the\nfoul occurs in the receiving team’s end zone during the kick, it is enforced from the previous spot.\nARTICLE 2. BLOCKING DURING ONSIDE KICK.\nItem 1. Kicking Team.\n(a) Between the Restraining Lines (10 Yards). Until the ball is legally touched, a kicking team player may not block or use his\nhands or arms against an opponent between the restraining lines, except to push or pull aside a receiver who is actively\nattempting to obstruct his attempt to proceed downfield. After the ball is legally touched, a kicking team player may legally\nblock an opponent, and he may use his hands and arms to push or pull an opponent out of the way in a personal attempt to\nrecover the ball or a receiver who is actively attempting to obstruct his attempt to proceed downfield.\n(b) At or Five Yards Beyond Receiving Team’s Restraining Line (Next Five Yards). Until the ball is legally touched or touches\nthe ground, a kicking team player may not block or use his hands or arms against an opponent in the area that is at or no\nmore than five yards beyond the receiving team’s restraining line, except to push or pull aside a receiver who is actively\nattempting to obstruct his attempt to proceed downfield. After the ball is legally touched or touches the ground, a kicking team\nplayer may legally block an opponent anywhere, and he may use his hands and arms to push or pull an opponent out of the\nway in a personal attempt to recover the ball.\n(c) More than 15 Yards Beyond Kicking Team’s Restraining Line. The kicking team may legally block more than 15 yards\nbeyond its restraining line.\nItem 2. Receiving Team.\n(a) First 15 Yards. Until the ball is legally touched or the ball hits the ground no player on the receiving team may initiate a block\nagainst the kicking team in the 15-yard area between the kicking team’s restraining line and five yards behind the receiving\nteam’s restraining line.\n(b) More than 15 Yards Beyond Kicking Team’s Restraining Line. The receiving team may legally block more than 15 yards\nbeyond the kicking team’s restraining line.\n(c) After the ball is kicked, receiving team players are subject to the blocking restrictions of the offense (see 12-1-1 through 12-\n1-3), and they may use their hands/arms legally to push or pull an opponent out of the way in a personal attempt to recover\nthe ball.\n(d) Double Team and Wedge Blocks. Restrictions in Article 1, Item 2(c) and (d) above and penalty enforcement for those blocks\nalso apply to onside kicks.\nPenalty: For illegal blocking on an onside kick or use of hands by either team: Loss of 10 yards.\nARTICLE 3. RUNNING INTO FREE KICKER. A player of the receiving team is not permitted to run into the kicker before he\nrecovers his balance. See also 12-2-8-i for personal fouls against the kicker.\nPenalty: For running into the kicker: Loss of five yards.\nARTICLE 4. FREE KICK OUT OF BOUNDS OR NOT REACHING THE LANDING ZONE. The kicking team may not (a) kick the\nball out of bounds, (b) be the last to touch the ball before it goes out of bounds between the goal lines, or (c) kick the ball which\nfirst touches the ground or a player in advance of the front yard line of the landing zone. If the receiving team is the last to touch\nthe ball before it goes out of bounds, the receiving team puts the ball in play at the inbounds spot.\nPenalty: For a kickoff or onside kick out of bounds or a kickoff that lands or is touched in advance of the front yard line\nof the landing zone: The receiving team may elect to take possession of the ball 25 yards from the spot of the kick at the\ninbounds line on the side of the field where the ball went out of bounds or lands or is touched short of the landing zone,\nat the out of bounds spot, or at the spot where the ball lands or is touched in advance of the front yard line of the landing\nzone if less than 25 yards.\nPenalty: For a safety kick out of bounds or a safety kick that lands or is touched in advance of the front yard line of the\nlanding zone: The receiving team may elect to take possession of the ball 30 yards from the spot of the kick at the\ninbounds line on the side of the field where the ball went out of bounds or lands or is touched short of the landing zone,\nat the out of bounds spot, or at the spot where the ball lands or is touched in advance of the front yard line of the landing\nzone if less than 30 yards.\nARTICLE 5. FREE KICK ILLEGALLY TOUCHED.\nItem 1. Ball Reaches Restraining Line During Onside Kick. A player of the kicking team may not touch, catch, or recover the\nball before it has reached the receiving team’s restraining line, unless it has first been touched by a receiving team player.\nPenalty: For illegal touching of an onside kick by the kicking team: Loss of five yards, or the receiving team takes\npossession of the ball at the spot of the illegal touch.\nItem 2. Player Out of Bounds. If a kicking team player goes out of bounds during the kick, either of his own volition or by being\nlegally forced out of bounds, he may not touch or recover the ball beyond the receiving team’s restraining line on an onside kick\nor in the landing zone or end zone on all other free kicks, unless it has first been touched by a receiving team player. If a kicking\nteam player touches the ball before reestablishing himself legally inbounds, it is a free kick out of bounds.\nPenalty: For illegal touching of a free kick by the kicking team: Loss of five yards.\nARTICLE 6. PLAYER VOLUNTARILY OUT OF BOUNDS ON A FREE KICK. Prior to the ball being touched by the receiving\nteam or the end of the kick, it is a foul if a kicking team player voluntarily goes out of bounds (without being contacted by a\nreceiving team player) to avoid a block.\nPenalty: For voluntarily going out of bounds on a free kick without contact: Loss of five yards."
  }
]